TexasInstruments/f29h85x-mcal/drivers/Port/include/Port_Pin_Map.h
/*********************************************************************************************************************
 *  COPYRIGHT
 *  ------------------------------------------------------------------------------------------------------------------
 *  \verbatim
 *
 *                 TEXAS INSTRUMENTS INCORPORATED PROPRIETARY INFORMATION
 *
 *                 Property of Texas Instruments, Unauthorized reproduction and/or distribution
 *                 is strictly prohibited.  This product  is  protected  under  copyright  law
 *                 and  trade  secret law as an  unpublished work.
 *                 (C) Copyright 2024 Texas Instruments Inc.  All rights reserved.
 *
 *  \endverbatim
 *  ------------------------------------------------------------------------------------------------------------------
 *  FILE DESCRIPTION
 *  ------------------------------------------------------------------------------------------------------------------
 *  File:       Port_Pin_Map.h
 *  Generator:  None
 *
 *  Description:  File defines the GPIO MUX values.     
 *  0x00000003 = MUX register value
 *  0x0000000C = GMUX register value
 *  0x0000FF00 = Shift amount within mux registers
 *  0xFFFF0000 = Offset of MUX register                                                    
 *********************************************************************************************************************/
#ifndef PORT_PIN_MAP_H
#define PORT_PIN_MAP_H

#ifdef __cplusplus
extern "C" {
#endif

/*********************************************************************************************************************
 * Header Files
 *********************************************************************************************************************/

/*********************************************************************************************************************
 * Version Check (if required)
 *********************************************************************************************************************/

/*********************************************************************************************************************
 * Exported Preprocessor #define Constants
 *********************************************************************************************************************/
/*
 *Design: MCAL-23522
 */

#define PORT_PIN_0_GPIO0         0x000C0000U
#define PORT_PIN_0_EPWM1_A       0x000C0001U
#define PORT_PIN_0_EMIF1_A13     0x000C0002U
#define PORT_PIN_0_EMIF1_D0      0x000C0003U
#define PORT_PIN_0_MCAND_TX      0x000C0005U
#define PORT_PIN_0_I2CA_SDA      0x000C0006U
#define PORT_PIN_0_UARTE_TX      0x000C0007U
#define PORT_PIN_0_OUTPUTXBAR9   0x000C0009U
#define PORT_PIN_0_ESC_TX0_DATA0 0x000C000AU
#define PORT_PIN_0_ESC_GPI0      0x000C000BU
#define PORT_PIN_0_FSITXA_D0     0x000C000DU

#define PORT_PIN_1_GPIO1         0x000C0200U
#define PORT_PIN_1_EPWM1_B       0x000C0201U
#define PORT_PIN_1_EMIF1_A14     0x000C0202U
#define PORT_PIN_1_EMIF1_D3      0x000C0203U
#define PORT_PIN_1_MCAND_RX      0x000C0205U
#define PORT_PIN_1_I2CA_SCL      0x000C0206U
#define PORT_PIN_1_UARTE_RX      0x000C0207U
#define PORT_PIN_1_OUTPUTXBAR10  0x000C0209U
#define PORT_PIN_1_ESC_TX1_DATA0 0x000C020AU
#define PORT_PIN_1_ESC_GPI1      0x000C020BU
#define PORT_PIN_1_FSITXA_D1     0x000C020DU

#define PORT_PIN_2_GPIO2       0x000C0400U
#define PORT_PIN_2_EPWM2_A     0x000C0401U
#define PORT_PIN_2_EMIF1_A15   0x000C0402U
#define PORT_PIN_2_EMIF1_D4    0x000C0403U
#define PORT_PIN_2_UARTA_TX    0x000C0405U
#define PORT_PIN_2_I2CB_SDA    0x000C0406U
#define PORT_PIN_2_MCANF_TX    0x000C0407U
#define PORT_PIN_2_OUTPUTXBAR1 0x000C0409U
#define PORT_PIN_2_ESC_RX1_ERR 0x000C040AU
#define PORT_PIN_2_ESC_GPI2    0x000C040BU
#define PORT_PIN_2_FSITXA_CLK  0x000C040DU

#define PORT_PIN_3_GPIO3       0x000C0600U
#define PORT_PIN_3_EPWM2_B     0x000C0601U
#define PORT_PIN_3_EMIF1_A16   0x000C0602U
#define PORT_PIN_3_EMIF1_D5    0x000C0603U
#define PORT_PIN_3_UARTA_RX    0x000C0605U
#define PORT_PIN_3_I2CB_SCL    0x000C0606U
#define PORT_PIN_3_MCANF_RX    0x000C0607U
#define PORT_PIN_3_OUTPUTXBAR2 0x000C0609U
#define PORT_PIN_3_ESC_GPI3    0x000C060BU
#define PORT_PIN_3_FSIRXA_D0   0x000C060DU

#define PORT_PIN_4_GPIO4       0x000C0800U
#define PORT_PIN_4_EPWM3_A     0x000C0801U
#define PORT_PIN_4_EMIF1_A17   0x000C0802U
#define PORT_PIN_4_EMIF1_D9    0x000C0803U
#define PORT_PIN_4_MCANC_TX    0x000C0805U
#define PORT_PIN_4_UARTF_TX    0x000C0807U
#define PORT_PIN_4_OUTPUTXBAR3 0x000C0809U
#define PORT_PIN_4_ESC_GPI4    0x000C080BU
#define PORT_PIN_4_FSIRXA_D1   0x000C080DU
#define PORT_PIN_4_ERRORSTS    0x000C080FU

#define PORT_PIN_5_GPIO5        0x000C0A00U
#define PORT_PIN_5_EPWM3_B      0x000C0A01U
#define PORT_PIN_5_EMIF1_A18    0x000C0A02U
#define PORT_PIN_5_EMIF1_D10    0x000C0A03U
#define PORT_PIN_5_MCANC_RX     0x000C0A05U
#define PORT_PIN_5_UARTF_RX     0x000C0A07U
#define PORT_PIN_5_OUTPUTXBAR11 0x000C0A09U
#define PORT_PIN_5_OUTPUTXBAR3  0x000C0A0AU
#define PORT_PIN_5_ESC_GPI5     0x000C0A0BU
#define PORT_PIN_5_FSIRXA_CLK   0x000C0A0DU

#define PORT_PIN_6_GPIO6       0x000C0C00U
#define PORT_PIN_6_EPWM4_A     0x000C0C01U
#define PORT_PIN_6_EMIF1_DQM0  0x000C0C02U
#define PORT_PIN_6_EMIF1_CLK   0x000C0C03U
#define PORT_PIN_6_MCANB_TX    0x000C0C05U
#define PORT_PIN_6_LINA_TX     0x000C0C06U
#define PORT_PIN_6_OUTPUTXBAR4 0x000C0C09U
#define PORT_PIN_6_SYNCOUT     0x000C0C0AU
#define PORT_PIN_6_ESC_GPI6    0x000C0C0BU
#define PORT_PIN_6_FSITXB_D0   0x000C0C0DU

#define PORT_PIN_7_GPIO7       0x000C0E00U
#define PORT_PIN_7_EPWM4_B     0x000C0E01U
#define PORT_PIN_7_EMIF1_DQM1  0x000C0E02U
#define PORT_PIN_7_EMIF1_CAS   0x000C0E03U
#define PORT_PIN_7_MCANB_RX    0x000C0E05U
#define PORT_PIN_7_LINA_RX     0x000C0E06U
#define PORT_PIN_7_OUTPUTXBAR5 0x000C0E09U
#define PORT_PIN_7_ESC_GPI7    0x000C0E0BU
#define PORT_PIN_7_FSITXB_D1   0x000C0E0DU

#define PORT_PIN_8_GPIO8        0x000C1000U
#define PORT_PIN_8_EPWM5_A      0x000C1001U
#define PORT_PIN_8_EMIF1_RAS    0x000C1002U
#define PORT_PIN_8_EPWM4_B      0x000C1003U
#define PORT_PIN_8_MCANC_TX     0x000C1005U
#define PORT_PIN_8_SPIE_PICO    0x000C1006U
#define PORT_PIN_8_UARTD_TX     0x000C1007U
#define PORT_PIN_8_OUTPUTXBAR12 0x000C1009U
#define PORT_PIN_8_ADCSOCAO     0x000C100AU
#define PORT_PIN_8_ESC_GPO0     0x000C100BU
#define PORT_PIN_8_FSITXB_CLK   0x000C100DU
#define PORT_PIN_8_FSITXA_D1    0x000C100EU
#define PORT_PIN_8_FSIRXA_D0    0x000C100FU

#define PORT_PIN_9_GPIO9       0x000C1200U
#define PORT_PIN_9_EPWM5_B     0x000C1201U
#define PORT_PIN_9_EMIF1_D11   0x000C1202U
#define PORT_PIN_9_SPIE_POCI   0x000C1206U
#define PORT_PIN_9_UARTD_RX    0x000C1207U
#define PORT_PIN_9_OUTPUTXBAR6 0x000C1209U
#define PORT_PIN_9_ESC_TX0_CLK 0x000C120AU
#define PORT_PIN_9_ESC_GPO1    0x000C120BU
#define PORT_PIN_9_FSIRXB_D0   0x000C120DU
#define PORT_PIN_9_FSITXA_D0   0x000C120EU
#define PORT_PIN_9_FSIRXA_CLK  0x000C120FU

