TexasInstruments/f29h85x-mcal/drivers/Port/include/Port_Pin_Map.h
#define PORT_PIN_10_GPIO10          0x000C1400U
#define PORT_PIN_10_EPWM8_A         0x000C1401U
#define PORT_PIN_10_PMBUSA_SCL      0x000C1402U
#define PORT_PIN_10_ADCSOCBO        0x000C1403U
#define PORT_PIN_10_MCANC_RX        0x000C1405U
#define PORT_PIN_10_UARTC_TX        0x000C1406U
#define PORT_PIN_10_I2CA_SCL        0x000C1407U
#define PORT_PIN_10_SENT2           0x000C1409U
#define PORT_PIN_10_ESC_GPI19       0x000C140DU
#define PORT_PIN_10_ADCA_EXTMUXSEL2 0x000C140EU
#define PORT_PIN_10_OUTPUTXBAR13    0x000C140FU

#define PORT_PIN_11_GPIO11        0x000C1600U
#define PORT_PIN_11_EPWM6_B       0x000C1601U
#define PORT_PIN_11_EMIF1_D15     0x000C1602U
#define PORT_PIN_11_EPWM7_B       0x000C1603U
#define PORT_PIN_11_SPIE_PTE      0x000C1606U
#define PORT_PIN_11_SD4_D1        0x000C1607U
#define PORT_PIN_11_PMBUSA_ALERT  0x000C1609U
#define PORT_PIN_11_ESC_TX0_DATA1 0x000C160AU
#define PORT_PIN_11_ESC_GPO3      0x000C160BU
#define PORT_PIN_11_FSIRXB_CLK    0x000C160DU
#define PORT_PIN_11_FSIRXA_D1     0x000C160EU
#define PORT_PIN_11_OUTPUTXBAR7   0x000C160FU

#define PORT_PIN_12_GPIO12        0x000C1800U
#define PORT_PIN_12_EPWM7_A       0x000C1801U
#define PORT_PIN_12_EMIF1_A1      0x000C1802U
#define PORT_PIN_12_ADCSOCAO      0x000C1803U
#define PORT_PIN_12_SPIE_CLK      0x000C1806U
#define PORT_PIN_12_SD4_C2        0x000C1807U
#define PORT_PIN_12_PMBUSA_CTL    0x000C1809U
#define PORT_PIN_12_ESC_TX0_DATA2 0x000C180AU
#define PORT_PIN_12_ESC_GPO4      0x000C180BU
#define PORT_PIN_12_FSIRXC_D0     0x000C180DU
#define PORT_PIN_12_FSIRXA_D0     0x000C180EU
#define PORT_PIN_12_OUTPUTXBAR14  0x000C180FU

#define PORT_PIN_13_GPIO13        0x000C1A00U
#define PORT_PIN_13_EPWM7_B       0x000C1A01U
#define PORT_PIN_13_EMIF1_CS0N    0x000C1A02U
#define PORT_PIN_13_EMIF1_D9      0x000C1A03U
#define PORT_PIN_13_UARTC_RX      0x000C1A06U
#define PORT_PIN_13_SD4_D2        0x000C1A07U
#define PORT_PIN_13_PMBUSA_SDA    0x000C1A09U
#define PORT_PIN_13_ESC_TX0_DATA3 0x000C1A0AU
#define PORT_PIN_13_ESC_GPO5      0x000C1A0BU
#define PORT_PIN_13_FSIRXC_D1     0x000C1A0DU
#define PORT_PIN_13_FSIRXA_CLK    0x000C1A0EU
#define PORT_PIN_13_OUTPUTXBAR15  0x000C1A0FU

#define PORT_PIN_14_GPIO14              0x000C1C00U
#define PORT_PIN_14_EPWM6_A             0x000C1C01U
#define PORT_PIN_14_EMIF1_D17           0x000C1C02U
#define PORT_PIN_14_EPWM18_A            0x000C1C03U
#define PORT_PIN_14_EMIF1_D13           0x000C1C05U
#define PORT_PIN_14_LINA_TX             0x000C1C06U
#define PORT_PIN_14_OUTPUTXBAR3         0x000C1C07U
#define PORT_PIN_14_PMBUSA_SCL          0x000C1C09U
#define PORT_PIN_14_ESC_PHY1_LINKSTATUS 0x000C1C0AU
#define PORT_PIN_14_ESC_GPO6            0x000C1C0BU
#define PORT_PIN_14_FSIRXC_CLK          0x000C1C0DU
#define PORT_PIN_14_SD4_C1              0x000C1C0EU
#define PORT_PIN_14_OUTPUTXBAR8         0x000C1C0FU

#define PORT_PIN_15_GPIO15          0x000C1E00U
#define PORT_PIN_15_EPWM8_B         0x000C1E01U
#define PORT_PIN_15_PMBUSA_CTL      0x000C1E03U
#define PORT_PIN_15_I2CA_SDA        0x000C1E05U
#define PORT_PIN_15_LINA_RX         0x000C1E06U
#define PORT_PIN_15_OUTPUTXBAR4     0x000C1E07U
#define PORT_PIN_15_SENT1           0x000C1E09U
#define PORT_PIN_15_ESC_GPO7        0x000C1E0AU
#define PORT_PIN_15_ESC_GPI20       0x000C1E0DU
#define PORT_PIN_15_ADCA_EXTMUXSEL3 0x000C1E0EU
#define PORT_PIN_15_OUTPUTXBAR16    0x000C1E0FU

#define PORT_PIN_16_GPIO16      0x00100000U
#define PORT_PIN_16_EPWM9_A     0x00100001U
#define PORT_PIN_16_EMIF1_D29   0x00100002U
#define PORT_PIN_16_EMIF1_BA0   0x00100003U
#define PORT_PIN_16_SPIA_PICO   0x00100005U
#define PORT_PIN_16_MCAND_TX    0x00100007U
#define PORT_PIN_16_ESC_RX1_CLK 0x0010000AU
#define PORT_PIN_16_SD1_D1      0x0010000BU
#define PORT_PIN_16_FSIRXD_D1   0x0010000DU
#define PORT_PIN_16_FSIRXC_CLK  0x0010000EU
#define PORT_PIN_16_OUTPUTXBAR7 0x0010000FU

#define PORT_PIN_17_GPIO17      0x00100200U
#define PORT_PIN_17_EPWM9_B     0x00100201U
#define PORT_PIN_17_EMIF1_DQM3  0x00100202U
#define PORT_PIN_17_EMIF1_BA1   0x00100203U
#define PORT_PIN_17_SPIA_POCI   0x00100205U
#define PORT_PIN_17_MCAND_RX    0x00100207U
#define PORT_PIN_17_ESC_RX1_DV  0x0010020AU
#define PORT_PIN_17_SD1_C1      0x0010020BU
#define PORT_PIN_17_FSIRXD_CLK  0x0010020DU
#define PORT_PIN_17_UARTC_TX    0x0010020EU
#define PORT_PIN_17_OUTPUTXBAR8 0x0010020FU

#define PORT_PIN_18_GPIO18          0x00100400U
#define PORT_PIN_18_EPWM15_A        0x00100401U
#define PORT_PIN_18_PMBUSA_ALERT    0x00100403U
#define PORT_PIN_18_I2CA_SCL        0x00100405U
#define PORT_PIN_18_UARTC_RX        0x00100406U
#define PORT_PIN_18_SENT4           0x00100409U
#define PORT_PIN_18_ESC_GPI21       0x0010040DU
#define PORT_PIN_18_ADCB_EXTMUXSEL0 0x0010040EU

#define PORT_PIN_19_GPIO19        0x00100600U
#define PORT_PIN_19_EPWM10_B      0x00100601U
#define PORT_PIN_19_EMIF1_CS3N    0x00100602U
#define PORT_PIN_19_ADCSOCBO      0x00100603U
#define PORT_PIN_19_SPIA_PTE      0x00100605U
#define PORT_PIN_19_UARTE_RX      0x00100606U
#define PORT_PIN_19_MCANC_TX      0x00100607U
#define PORT_PIN_19_PMBUSA_ALERT  0x00100609U
#define PORT_PIN_19_ESC_TX1_DATA3 0x0010060AU
#define PORT_PIN_19_SD1_C2        0x0010060BU

#define PORT_PIN_20_GPIO20        0x00100800U
#define PORT_PIN_20_EPWM11_A      0x00100801U
#define PORT_PIN_20_EMIF1_BA0     0x00100802U
#define PORT_PIN_20_EMIF1_DQM2    0x00100803U
#define PORT_PIN_20_SPIC_PICO     0x00100806U
#define PORT_PIN_20_MCANB_RX      0x00100807U
#define PORT_PIN_20_ESC_TX1_DATA2 0x0010080AU
#define PORT_PIN_20_SD1_D3        0x0010080BU

#define PORT_PIN_21_GPIO21        0x00100A00U
#define PORT_PIN_21_EPWM11_B      0x00100A01U
#define PORT_PIN_21_EMIF1_BA1     0x00100A02U
#define PORT_PIN_21_SPIC_POCI     0x00100A06U
#define PORT_PIN_21_MCANB_TX      0x00100A07U
#define PORT_PIN_21_ESC_TX1_DATA1 0x00100A0AU
#define PORT_PIN_21_SD1_C3        0x00100A0BU

#define PORT_PIN_22_GPIO22          0x00100C00U
#define PORT_PIN_22_EPWM12_A        0x00100C01U
#define PORT_PIN_22_PMBUSA_SDA      0x00100C03U
#define PORT_PIN_22_I2CB_SDA        0x00100C05U
#define PORT_PIN_22_UARTB_TX        0x00100C06U
#define PORT_PIN_22_MCANC_TX        0x00100C07U
#define PORT_PIN_22_SENT5           0x00100C09U
#define PORT_PIN_22_ESC_GPO2        0x00100C0AU
#define PORT_PIN_22_ESC_GPI22       0x00100C0DU
#define PORT_PIN_22_ADCB_EXTMUXSEL1 0x00100C0EU

#define PORT_PIN_23_GPIO23          0x00100E00U
#define PORT_PIN_23_EPWM12_B        0x00100E01U
#define PORT_PIN_23_PMBUSA_SCL      0x00100E03U
#define PORT_PIN_23_I2CB_SCL        0x00100E05U
#define PORT_PIN_23_UARTB_RX        0x00100E06U
#define PORT_PIN_23_MCANC_RX        0x00100E07U
#define PORT_PIN_23_SENT6           0x00100E09U
#define PORT_PIN_23_ESC_PHY_RESETN  0x00100E0AU
#define PORT_PIN_23_ESC_GPI23       0x00100E0DU
#define PORT_PIN_23_ADCC_EXTMUXSEL0 0x00100E0EU

