TexasInstruments/f29h85x-mcal/drivers/Port/include/Port_Pin_Map.h
#define PORT_PIN_24_GPIO24      0x00101000U
#define PORT_PIN_24_EPWM13_A    0x00101001U
#define PORT_PIN_24_EMIF1_DQM0  0x00101002U
#define PORT_PIN_24_SPIB_PICO   0x00101005U
#define PORT_PIN_24_LINB_TX     0x00101006U
#define PORT_PIN_24_MCANE_TX    0x00101007U
#define PORT_PIN_24_ESC_RX0_CLK 0x0010100AU
#define PORT_PIN_24_SD2_D1      0x0010100BU
#define PORT_PIN_24_ESC_GPI24   0x0010100DU
#define PORT_PIN_24_EPWM2_A     0x0010100EU
#define PORT_PIN_24_OUTPUTXBAR1 0x0010100FU

#define PORT_PIN_25_GPIO25      0x00101200U
#define PORT_PIN_25_EPWM13_B    0x00101201U
#define PORT_PIN_25_EMIF1_DQM1  0x00101202U
#define PORT_PIN_25_SPIB_POCI   0x00101205U
#define PORT_PIN_25_LINB_RX     0x00101206U
#define PORT_PIN_25_MCANE_RX    0x00101207U
#define PORT_PIN_25_PMBUSA_SDA  0x00101209U
#define PORT_PIN_25_ESC_RX0_DV  0x0010120AU
#define PORT_PIN_25_SD2_C1      0x0010120BU
#define PORT_PIN_25_FSITXA_D1   0x0010120DU
#define PORT_PIN_25_EPWM2_B     0x0010120EU
#define PORT_PIN_25_OUTPUTXBAR2 0x0010120FU

#define PORT_PIN_26_GPIO26       0x00101400U
#define PORT_PIN_26_EPWM14_A     0x00101401U
#define PORT_PIN_26_EMIF1_DQM2   0x00101402U
#define PORT_PIN_26_SPIB_CLK     0x00101405U
#define PORT_PIN_26_UARTE_TX     0x00101406U
#define PORT_PIN_26_MCANE_TX     0x00101407U
#define PORT_PIN_26_PMBUSA_CTL   0x00101409U
#define PORT_PIN_26_ESC_RX0_ERR  0x0010140AU
#define PORT_PIN_26_SD2_D2       0x0010140BU
#define PORT_PIN_26_FSITXA_D0    0x0010140DU
#define PORT_PIN_26_ESC_MDIO_CLK 0x0010140EU
#define PORT_PIN_26_OUTPUTXBAR3  0x0010140FU

#define PORT_PIN_27_GPIO27        0x00101600U
#define PORT_PIN_27_EPWM14_B      0x00101601U
#define PORT_PIN_27_EMIF1_DQM3    0x00101602U
#define PORT_PIN_27_SPIB_PTE      0x00101605U
#define PORT_PIN_27_UARTA_TX      0x00101606U
#define PORT_PIN_27_EPWM4_A       0x00101609U
#define PORT_PIN_27_ESC_RX0_DATA0 0x0010160AU
#define PORT_PIN_27_SD2_C2        0x0010160BU
#define PORT_PIN_27_FSITXA_CLK    0x0010160DU
#define PORT_PIN_27_ESC_MDIO_DATA 0x0010160EU
#define PORT_PIN_27_OUTPUTXBAR4   0x0010160FU

#define PORT_PIN_28_GPIO28        0x00101800U
#define PORT_PIN_28_EPWM15_A      0x00101801U
#define PORT_PIN_28_EMIF1_CS4N    0x00101802U
#define PORT_PIN_28_EMIF1_CS2N    0x00101803U
#define PORT_PIN_28_UARTA_RX      0x00101806U
#define PORT_PIN_28_EPWM4_B       0x00101809U
#define PORT_PIN_28_ESC_RX0_DATA1 0x0010180AU
#define PORT_PIN_28_SD2_D3        0x0010180BU
#define PORT_PIN_28_OUTPUTXBAR5   0x0010180FU

#define PORT_PIN_29_GPIO29          0x00101A00U
#define PORT_PIN_29_EPWM15_B        0x00101A01U
#define PORT_PIN_29_PMBUSA_SDA      0x00101A02U
#define PORT_PIN_29_UARTE_RX        0x00101A06U
#define PORT_PIN_29_I2CA_SDA        0x00101A07U
#define PORT_PIN_29_SENT3           0x00101A09U
#define PORT_PIN_29_ESC_LATCH0      0x00101A0AU
#define PORT_PIN_29_ESC_I2C_SDA     0x00101A0DU
#define PORT_PIN_29_ADCC_EXTMUXSEL1 0x00101A0EU
#define PORT_PIN_29_OUTPUTXBAR6     0x00101A0FU

#define PORT_PIN_30_GPIO30      0x00101C00U
#define PORT_PIN_30_EPWM16_A    0x00101C01U
#define PORT_PIN_30_EMIF1_CLK   0x00101C02U
#define PORT_PIN_30_EMIF1_CS4N  0x00101C03U
#define PORT_PIN_30_MCANC_RX    0x00101C05U
#define PORT_PIN_30_SPID_PICO   0x00101C06U
#define PORT_PIN_30_EMIF1_A12   0x00101C07U
#define PORT_PIN_30_ESC_LATCH1  0x00101C0AU
#define PORT_PIN_30_SD2_D4      0x00101C0BU
#define PORT_PIN_30_ESC_I2C_SCL 0x00101C0DU
#define PORT_PIN_30_ESC_SYNC1   0x00101C0EU
#define PORT_PIN_30_OUTPUTXBAR7 0x00101C0FU

#define PORT_PIN_31_GPIO31        0x00101E00U
#define PORT_PIN_31_EPWM16_B      0x00101E01U
#define PORT_PIN_31_EMIF1_WEN     0x00101E02U
#define PORT_PIN_31_EMIF1_RNW     0x00101E03U
#define PORT_PIN_31_MCANC_TX      0x00101E05U
#define PORT_PIN_31_SPID_POCI     0x00101E06U
#define PORT_PIN_31_I2CA_SDA      0x00101E07U
#define PORT_PIN_31_ESC_RX1_DATA0 0x00101E0AU
#define PORT_PIN_31_SD2_C4        0x00101E0BU
#define PORT_PIN_31_FSITXD_D0     0x00101E0DU
#define PORT_PIN_31_OUTPUTXBAR8   0x00101E0FU

#define PORT_PIN_32_GPIO32        0x008C0000U
#define PORT_PIN_32_EMIF1_CS0N    0x008C0002U
#define PORT_PIN_32_EMIF1_OEN     0x008C0003U
#define PORT_PIN_32_SPIA_PICO     0x008C0005U
#define PORT_PIN_32_SPID_CLK      0x008C0006U
#define PORT_PIN_32_I2CA_SDA      0x008C0007U
#define PORT_PIN_32_OUTPUTXBAR9   0x008C0009U
#define PORT_PIN_32_ESC_RX0_DATA0 0x008C000AU

#define PORT_PIN_33_GPIO33       0x008C0200U
#define PORT_PIN_33_EMIF1_RNW    0x008C0202U
#define PORT_PIN_33_EMIF1_BA0    0x008C0203U
#define PORT_PIN_33_SPIA_POCI    0x008C0205U
#define PORT_PIN_33_SPID_PTE     0x008C0206U
#define PORT_PIN_33_I2CA_SCL     0x008C0207U
#define PORT_PIN_33_OUTPUTXBAR10 0x008C0209U
#define PORT_PIN_33_ESC_LED_ERR  0x008C020AU

#define PORT_PIN_34_GPIO34       0x008C0400U
#define PORT_PIN_34_EPWM18_A     0x008C0401U
#define PORT_PIN_34_EMIF1_CS2N   0x008C0402U
#define PORT_PIN_34_EMIF1_BA1    0x008C0403U
#define PORT_PIN_34_SPIA_CLK     0x008C0405U
#define PORT_PIN_34_UARTF_TX     0x008C0406U
#define PORT_PIN_34_I2CB_SDA     0x008C0407U
#define PORT_PIN_34_OUTPUTXBAR11 0x008C0409U
#define PORT_PIN_34_ESC_LATCH0   0x008C040AU
#define PORT_PIN_34_EPWM3_B      0x008C040DU
#define PORT_PIN_34_ESC_SYNC0    0x008C040EU
#define PORT_PIN_34_OUTPUTXBAR1  0x008C040FU

#define PORT_PIN_35_GPIO35       0x008C0600U
#define PORT_PIN_35_EPWM18_B     0x008C0601U
#define PORT_PIN_35_EMIF1_CS3N   0x008C0602U
#define PORT_PIN_35_EMIF1_A0     0x008C0603U
#define PORT_PIN_35_SPIA_PTE     0x008C0605U
#define PORT_PIN_35_UARTF_RX     0x008C0606U
#define PORT_PIN_35_I2CB_SCL     0x008C0607U
#define PORT_PIN_35_OUTPUTXBAR12 0x008C0609U
#define PORT_PIN_35_ESC_LATCH1   0x008C060AU
#define PORT_PIN_35_ESC_SYNC1    0x008C060EU

#define PORT_PIN_36_GPIO36       0x008C0800U
#define PORT_PIN_36_EMIF1_WAIT   0x008C0802U
#define PORT_PIN_36_EMIF1_A1     0x008C0803U
#define PORT_PIN_36_UARTC_TX     0x008C0805U
#define PORT_PIN_36_MCANC_RX     0x008C0806U
#define PORT_PIN_36_OUTPUTXBAR13 0x008C0809U
#define PORT_PIN_36_SD1_D1       0x008C080BU
#define PORT_PIN_36_EMIF1_WEN    0x008C080EU

