TexasInstruments/f29h85x-mcal/drivers/Port/include/Port_Pin_Map.h
#define PORT_PIN_37_GPIO37        0x008C0A00U
#define PORT_PIN_37_EPWM18_A      0x008C0A01U
#define PORT_PIN_37_EMIF1_OEN     0x008C0A02U
#define PORT_PIN_37_EMIF1_A2      0x008C0A03U
#define PORT_PIN_37_UARTC_RX      0x008C0A05U
#define PORT_PIN_37_MCANC_TX      0x008C0A06U
#define PORT_PIN_37_OUTPUTXBAR14  0x008C0A09U
#define PORT_PIN_37_ESC_RX1_DATA1 0x008C0A0AU
#define PORT_PIN_37_SD1_D2        0x008C0A0BU
#define PORT_PIN_37_EMIF1_D24     0x008C0A0EU
#define PORT_PIN_37_OUTPUTXBAR2   0x008C0A0FU

#define PORT_PIN_38_GPIO38        0x008C0C00U
#define PORT_PIN_38_EPWM18_B      0x008C0C01U
#define PORT_PIN_38_EMIF1_A0      0x008C0C02U
#define PORT_PIN_38_EMIF1_A3      0x008C0C03U
#define PORT_PIN_38_UARTA_TX      0x008C0C05U
#define PORT_PIN_38_SPIE_PICO     0x008C0C06U
#define PORT_PIN_38_OUTPUTXBAR15  0x008C0C09U
#define PORT_PIN_38_ESC_RX0_DATA1 0x008C0C0AU
#define PORT_PIN_38_SD1_D3        0x008C0C0BU
#define PORT_PIN_38_FSITXD_D1     0x008C0C0DU
#define PORT_PIN_38_EMIF1_CS2N    0x008C0C0EU

#define PORT_PIN_39_GPIO39        0x008C0E00U
#define PORT_PIN_39_EMIF1_A1      0x008C0E02U
#define PORT_PIN_39_EMIF1_A4      0x008C0E03U
#define PORT_PIN_39_UARTA_RX      0x008C0E05U
#define PORT_PIN_39_OUTPUTXBAR16  0x008C0E09U
#define PORT_PIN_39_ESC_MDIO_DATA 0x008C0E0AU
#define PORT_PIN_39_SD1_D4        0x008C0E0BU
#define PORT_PIN_39_FSIRXD_CLK    0x008C0E0DU
#define PORT_PIN_39_ESC_LED_RUN   0x008C0E0FU

#define PORT_PIN_40_GPIO40      0x008C1000U
#define PORT_PIN_40_EPWM13_A    0x008C1001U
#define PORT_PIN_40_EMIF1_A2    0x008C1002U
#define PORT_PIN_40_MCANB_RX    0x008C1005U
#define PORT_PIN_40_I2CB_SDA    0x008C1006U
#define PORT_PIN_40_OUTPUTXBAR9 0x008C1009U
#define PORT_PIN_40_ESC_GPO2    0x008C100AU
#define PORT_PIN_40_SD4_C3      0x008C100BU
#define PORT_PIN_40_EPWM1_A     0x008C100EU
#define PORT_PIN_40_SD2_C1      0x008C100FU

#define PORT_PIN_41_GPIO41        0x008C1200U
#define PORT_PIN_41_EPWM13_B      0x008C1201U
#define PORT_PIN_41_EMIF1_A3      0x008C1202U
#define PORT_PIN_41_EPWM18_A      0x008C1203U
#define PORT_PIN_41_MCANB_TX      0x008C1205U
#define PORT_PIN_41_SPIE_POCI     0x008C1206U
#define PORT_PIN_41_I2CB_SCL      0x008C1207U
#define PORT_PIN_41_OUTPUTXBAR10  0x008C1209U
#define PORT_PIN_41_ESC_RX0_DATA2 0x008C120AU
#define PORT_PIN_41_SD4_D3        0x008C120BU
#define PORT_PIN_41_FSIRXD_CLK    0x008C120DU
#define PORT_PIN_41_EPWM1_B       0x008C120EU
#define PORT_PIN_41_SD2_D1        0x008C120FU

#define PORT_PIN_42_GPIO42          0x008C1400U
#define PORT_PIN_42_EPWM14_A        0x008C1401U
#define PORT_PIN_42_EMIF1_A2        0x008C1402U
#define PORT_PIN_42_EMIF1_A13       0x008C1403U
#define PORT_PIN_42_UARTA_TX        0x008C1405U
#define PORT_PIN_42_SPIE_CLK        0x008C1406U
#define PORT_PIN_42_I2CA_SDA        0x008C1407U
#define PORT_PIN_42_OUTPUTXBAR13    0x008C1409U
#define PORT_PIN_42_SD4_C3          0x008C140AU
#define PORT_PIN_42_SD4_C4          0x008C140BU
#define PORT_PIN_42_FSIRXD_D0       0x008C140DU
#define PORT_PIN_42_ADCE_EXTMUXSEL2 0x008C140EU

#define PORT_PIN_43_GPIO43          0x008C1600U
#define PORT_PIN_43_EPWM14_B        0x008C1601U
#define PORT_PIN_43_EMIF1_A4        0x008C1602U
#define PORT_PIN_43_EMIF1_D13       0x008C1603U
#define PORT_PIN_43_UARTA_RX        0x008C1605U
#define PORT_PIN_43_SPIE_PTE        0x008C1606U
#define PORT_PIN_43_I2CA_SCL        0x008C1607U
#define PORT_PIN_43_OUTPUTXBAR14    0x008C1609U
#define PORT_PIN_43_SD4_D4          0x008C160BU
#define PORT_PIN_43_FSIRXD_D1       0x008C160DU
#define PORT_PIN_43_ADCE_EXTMUXSEL3 0x008C160EU

#define PORT_PIN_44_GPIO44       0x008C1800U
#define PORT_PIN_44_EMIF1_A4     0x008C1802U
#define PORT_PIN_44_SPID_POCI    0x008C1805U
#define PORT_PIN_44_MCANB_RX     0x008C1806U
#define PORT_PIN_44_UARTB_TX     0x008C1807U
#define PORT_PIN_44_OUTPUTXBAR14 0x008C1809U
#define PORT_PIN_44_ESC_TX1_CLK  0x008C180AU
#define PORT_PIN_44_SD3_C4       0x008C180BU
#define PORT_PIN_44_FSIRXD_CLK   0x008C180DU

#define PORT_PIN_45_GPIO45       0x008C1A00U
#define PORT_PIN_45_EMIF1_A5     0x008C1A02U
#define PORT_PIN_45_SPID_PTE     0x008C1A05U
#define PORT_PIN_45_MCANB_TX     0x008C1A06U
#define PORT_PIN_45_UARTB_RX     0x008C1A07U
#define PORT_PIN_45_OUTPUTXBAR15 0x008C1A09U
#define PORT_PIN_45_ESC_TX1_ENA  0x008C1A0AU
#define PORT_PIN_45_SD3_D4       0x008C1A0BU
#define PORT_PIN_45_FSIRXD_D0    0x008C1A0DU

#define PORT_PIN_46_GPIO46       0x008C1C00U
#define PORT_PIN_46_EPWM4_A      0x008C1C01U
#define PORT_PIN_46_EMIF1_A6     0x008C1C02U
#define PORT_PIN_46_EPWM14_A     0x008C1C03U
#define PORT_PIN_46_UARTC_TX     0x008C1C05U
#define PORT_PIN_46_MCANE_TX     0x008C1C07U
#define PORT_PIN_46_ESC_MDIO_CLK 0x008C1C0AU
#define PORT_PIN_46_SD3_C4       0x008C1C0BU

#define PORT_PIN_47_GPIO47        0x008C1E00U
#define PORT_PIN_47_EPWM4_B       0x008C1E01U
#define PORT_PIN_47_EMIF1_A7      0x008C1E02U
#define PORT_PIN_47_EPWM14_B      0x008C1E03U
#define PORT_PIN_47_UARTC_RX      0x008C1E05U
#define PORT_PIN_47_MCANE_RX      0x008C1E07U
#define PORT_PIN_47_ESC_MDIO_DATA 0x008C1E0AU
#define PORT_PIN_47_SD4_C3        0x008C1E0BU

#define PORT_PIN_48_GPIO48      0x00900000U
#define PORT_PIN_48_EMIF1_A8    0x00900002U
#define PORT_PIN_48_UARTD_TX    0x00900005U
#define PORT_PIN_48_OUTPUTXBAR3 0x00900009U
#define PORT_PIN_48_ESC_PHY_CLK 0x0090000AU
#define PORT_PIN_48_SD1_D1      0x0090000BU
#define PORT_PIN_48_EPWM3_A     0x0090000DU
#define PORT_PIN_48_SD2_C2      0x0090000FU

#define PORT_PIN_49_GPIO49        0x00900200U
#define PORT_PIN_49_EMIF1_A9      0x00900202U
#define PORT_PIN_49_EMIF1_A5      0x00900203U
#define PORT_PIN_49_UARTD_RX      0x00900205U
#define PORT_PIN_49_OUTPUTXBAR4   0x00900209U
#define PORT_PIN_49_ESC_TX1_DATA2 0x0090020AU
#define PORT_PIN_49_SD1_C1        0x0090020BU
#define PORT_PIN_49_FSITXA_D0     0x0090020DU
#define PORT_PIN_49_SD2_D1        0x0090020FU

#define PORT_PIN_50_GPIO50        0x00900400U
#define PORT_PIN_50_EPWM15_A      0x00900401U
#define PORT_PIN_50_EMIF1_A10     0x00900402U
#define PORT_PIN_50_EMIF1_A6      0x00900403U
#define PORT_PIN_50_SPIC_PICO     0x00900406U
#define PORT_PIN_50_MCANF_TX      0x00900407U
#define PORT_PIN_50_ESC_TX1_DATA1 0x0090040AU
#define PORT_PIN_50_SD1_D2        0x0090040BU
#define PORT_PIN_50_FSITXA_D1     0x0090040DU
#define PORT_PIN_50_ESC_GPI25     0x0090040EU
#define PORT_PIN_50_SD2_D2        0x0090040FU

