TexasInstruments/f29h85x-mcal/drivers/Port/include/Port_Pin_Map.h
#define PORT_PIN_51_GPIO51      0x00900600U
#define PORT_PIN_51_EPWM15_B    0x00900601U
#define PORT_PIN_51_EMIF1_A11   0x00900602U
#define PORT_PIN_51_EMIF1_A7    0x00900603U
#define PORT_PIN_51_SPIC_POCI   0x00900606U
#define PORT_PIN_51_MCANF_RX    0x00900607U
#define PORT_PIN_51_ESC_TX1_CLK 0x0090060AU
#define PORT_PIN_51_SD1_C2      0x0090060BU
#define PORT_PIN_51_FSITXA_CLK  0x0090060DU
#define PORT_PIN_51_ESC_GPI26   0x0090060EU
#define PORT_PIN_51_SD2_D3      0x0090060FU

#define PORT_PIN_52_GPIO52      0x00900800U
#define PORT_PIN_52_EPWM16_A    0x00900801U
#define PORT_PIN_52_EMIF1_A12   0x00900802U
#define PORT_PIN_52_EMIF1_A8    0x00900803U
#define PORT_PIN_52_UARTD_TX    0x00900805U
#define PORT_PIN_52_SPIC_CLK    0x00900806U
#define PORT_PIN_52_ESC_TX1_ENA 0x0090080AU
#define PORT_PIN_52_SD1_D3      0x0090080BU
#define PORT_PIN_52_FSIRXA_D0   0x0090080DU
#define PORT_PIN_52_SD2_D4      0x0090080FU

#define PORT_PIN_53_GPIO53              0x00900A00U
#define PORT_PIN_53_EPWM16_B            0x00900A01U
#define PORT_PIN_53_EMIF1_D31           0x00900A02U
#define PORT_PIN_53_EMIF1_A9            0x00900A03U
#define PORT_PIN_53_UARTD_RX            0x00900A05U
#define PORT_PIN_53_SPIC_PTE            0x00900A06U
#define PORT_PIN_53_ESC_PHY0_LINKSTATUS 0x00900A0AU
#define PORT_PIN_53_SD1_C3              0x00900A0BU
#define PORT_PIN_53_FSIRXA_D1           0x00900A0DU
#define PORT_PIN_53_ESC_GPI28           0x00900A0EU
#define PORT_PIN_53_SD1_C1              0x00900A0FU

#define PORT_PIN_54_GPIO54      0x00900C00U
#define PORT_PIN_54_EMIF1_D30   0x00900C02U
#define PORT_PIN_54_EMIF1_A10   0x00900C03U
#define PORT_PIN_54_SPIA_PICO   0x00900C05U
#define PORT_PIN_54_ESC_PHY_CLK 0x00900C0AU
#define PORT_PIN_54_SD1_D4      0x00900C0BU
#define PORT_PIN_54_FSIRXA_CLK  0x00900C0DU
#define PORT_PIN_54_ESC_GPI29   0x00900C0EU
#define PORT_PIN_54_SD1_C2      0x00900C0FU

#define PORT_PIN_55_GPIO55              0x00900E00U
#define PORT_PIN_55_EPWM16_B            0x00900E01U
#define PORT_PIN_55_EMIF1_D29           0x00900E02U
#define PORT_PIN_55_EMIF1_D0            0x00900E03U
#define PORT_PIN_55_SPIA_POCI           0x00900E05U
#define PORT_PIN_55_EMIF1_WAIT          0x00900E06U
#define PORT_PIN_55_ESC_PHY0_LINKSTATUS 0x00900E0AU
#define PORT_PIN_55_SD1_C4              0x00900E0BU
#define PORT_PIN_55_FSITXB_D0           0x00900E0DU
#define PORT_PIN_55_SD1_C3              0x00900E0FU

#define PORT_PIN_56_GPIO56         0x00901000U
#define PORT_PIN_56_EPWM17_A       0x00901001U
#define PORT_PIN_56_EMIF1_D28      0x00901002U
#define PORT_PIN_56_EMIF1_D1       0x00901003U
#define PORT_PIN_56_SPIA_CLK       0x00901005U
#define PORT_PIN_56_MCAND_TX       0x00901006U
#define PORT_PIN_56_I2CA_SDA       0x00901007U
#define PORT_PIN_56_ESC_PDI_UC_IRQ 0x0090100AU
#define PORT_PIN_56_SD2_D1         0x0090100BU
#define PORT_PIN_56_FSITXB_CLK     0x0090100DU
#define PORT_PIN_56_ESC_GPI30      0x0090100EU
#define PORT_PIN_56_SD1_C4         0x0090100FU

#define PORT_PIN_57_GPIO57        0x00901200U
#define PORT_PIN_57_EPWM17_B      0x00901201U
#define PORT_PIN_57_EMIF1_D27     0x00901202U
#define PORT_PIN_57_EMIF1_D2      0x00901203U
#define PORT_PIN_57_SPIA_PTE      0x00901205U
#define PORT_PIN_57_MCAND_RX      0x00901206U
#define PORT_PIN_57_I2CA_SCL      0x00901207U
#define PORT_PIN_57_ESC_MDIO_DATA 0x0090120AU
#define PORT_PIN_57_SD2_C1        0x0090120BU
#define PORT_PIN_57_FSITXB_D1     0x0090120DU
#define PORT_PIN_57_ESC_GPI31     0x0090120EU
#define PORT_PIN_57_SD3_D3        0x0090120FU

#define PORT_PIN_58_GPIO58               0x00901400U
#define PORT_PIN_58_EPWM13_A             0x00901401U
#define PORT_PIN_58_EMIF1_D26            0x00901402U
#define PORT_PIN_58_EPWM8_A              0x00901403U
#define PORT_PIN_58_SPIA_PICO            0x00901405U
#define PORT_PIN_58_MCANC_RX             0x00901407U
#define PORT_PIN_58_SENT1                0x00901409U
#define PORT_PIN_58_ESC_LED_LINK0_ACTIVE 0x0090140AU
#define PORT_PIN_58_SD2_D2               0x0090140BU
#define PORT_PIN_58_FSIRXB_D0            0x0090140DU
#define PORT_PIN_58_ESC_TX0_DATA3        0x0090140EU
#define PORT_PIN_58_SD2_C2               0x0090140FU

#define PORT_PIN_59_GPIO59               0x00901600U
#define PORT_PIN_59_EPWM5_A              0x00901601U
#define PORT_PIN_59_EMIF1_D25            0x00901602U
#define PORT_PIN_59_EPWM8_B              0x00901603U
#define PORT_PIN_59_SPIA_POCI            0x00901605U
#define PORT_PIN_59_MCANC_TX             0x00901607U
#define PORT_PIN_59_SENT2                0x00901609U
#define PORT_PIN_59_ESC_LED_LINK1_ACTIVE 0x0090160AU
#define PORT_PIN_59_SD2_C2               0x0090160BU
#define PORT_PIN_59_FSIRXB_D1            0x0090160DU
#define PORT_PIN_59_ESC_TX0_ENA          0x0090160EU
#define PORT_PIN_59_SD2_C3               0x0090160FU

#define PORT_PIN_60_GPIO60      0x00901800U
#define PORT_PIN_60_EPWM3_B     0x00901801U
#define PORT_PIN_60_EMIF1_D24   0x00901802U
#define PORT_PIN_60_EMIF1_D0    0x00901803U
#define PORT_PIN_60_SPIA_CLK    0x00901805U
#define PORT_PIN_60_OUTPUTXBAR3 0x00901806U
#define PORT_PIN_60_SENT3       0x00901809U
#define PORT_PIN_60_ESC_LED_ERR 0x0090180AU
#define PORT_PIN_60_ESC_LATCH0  0x0090180BU
#define PORT_PIN_60_FSIRXB_CLK  0x0090180DU
#define PORT_PIN_60_SD2_C4      0x0090180FU

#define PORT_PIN_61_GPIO61      0x00901A00U
#define PORT_PIN_61_EPWM17_B    0x00901A01U
#define PORT_PIN_61_EMIF1_D23   0x00901A02U
#define PORT_PIN_61_EMIF1_D6    0x00901A03U
#define PORT_PIN_61_SPIA_PTE    0x00901A05U
#define PORT_PIN_61_MCANC_RX    0x00901A07U
#define PORT_PIN_61_OUTPUTXBAR4 0x00901A09U
#define PORT_PIN_61_ESC_LED_RUN 0x00901A0AU
#define PORT_PIN_61_SD2_C3      0x00901A0BU
#define PORT_PIN_61_FSITXD_CLK  0x00901A0DU
#define PORT_PIN_61_ESC_LATCH1  0x00901A0EU

#define PORT_PIN_62_GPIO62            0x00901C00U
#define PORT_PIN_62_EPWM17_A          0x00901C01U
#define PORT_PIN_62_EMIF1_D22         0x00901C02U
#define PORT_PIN_62_EMIF1_D7          0x00901C03U
#define PORT_PIN_62_MCANC_RX          0x00901C06U
#define PORT_PIN_62_MCANC_TX          0x00901C07U
#define PORT_PIN_62_SENT4             0x00901C09U
#define PORT_PIN_62_ESC_LED_STATE_RUN 0x00901C0AU
#define PORT_PIN_62_SD2_D4            0x00901C0BU
#define PORT_PIN_62_FSITXD_D0         0x00901C0DU
#define PORT_PIN_62_ESC_MDIO_CLK      0x00901C0EU

#define PORT_PIN_63_GPIO63          0x00901E00U
#define PORT_PIN_63_EPWM9_A         0x00901E01U
#define PORT_PIN_63_EMIF1_D21       0x00901E02U
#define PORT_PIN_63_EMIF1_RNW       0x00901E03U
#define PORT_PIN_63_SPIB_PICO       0x00901E05U
#define PORT_PIN_63_MCANC_TX        0x00901E06U
#define PORT_PIN_63_SENT5           0x00901E09U
#define PORT_PIN_63_ESC_RX1_DATA0   0x00901E0AU
#define PORT_PIN_63_SD1_D1          0x00901E0BU
#define PORT_PIN_63_FSITXD_D1       0x00901E0DU
#define PORT_PIN_63_ADCD_EXTMUXSEL0 0x00901E0EU
#define PORT_PIN_63_SD2_C4          0x00901E0FU

#define PORT_PIN_64_GPIO64          0x010C0000U
#define PORT_PIN_64_EPWM9_B         0x010C0001U
#define PORT_PIN_64_EMIF1_D20       0x010C0002U
#define PORT_PIN_64_EMIF1_WAIT      0x010C0003U
#define PORT_PIN_64_SPIB_POCI       0x010C0005U
#define PORT_PIN_64_MCANA_TX        0x010C0006U
#define PORT_PIN_64_UARTF_TX        0x010C0007U
#define PORT_PIN_64_SENT6           0x010C0009U
#define PORT_PIN_64_ESC_RX1_DATA1   0x010C000AU
#define PORT_PIN_64_SD1_C1          0x010C000BU
#define PORT_PIN_64_FSITXD_CLK      0x010C000DU
#define PORT_PIN_64_ADCD_EXTMUXSEL1 0x010C000EU

#define PORT_PIN_65_GPIO65          0x010C0200U
#define PORT_PIN_65_EPWM10_A        0x010C0201U
#define PORT_PIN_65_EMIF1_D19       0x010C0202U
#define PORT_PIN_65_EMIF1_WEN       0x010C0203U
#define PORT_PIN_65_SPIB_CLK        0x010C0205U
#define PORT_PIN_65_MCANA_RX        0x010C0206U
#define PORT_PIN_65_UARTF_RX        0x010C0207U
#define PORT_PIN_65_ESC_RX1_DATA2   0x010C020AU
#define PORT_PIN_65_SD1_D2          0x010C020BU
#define PORT_PIN_65_FSITXB_CLK      0x010C020DU
#define PORT_PIN_65_ADCD_EXTMUXSEL2 0x010C020EU
#define PORT_PIN_65_ESC_GPI13       0x010C020FU

#define PORT_PIN_66_GPIO66          0x010C0400U
#define PORT_PIN_66_EPWM10_B        0x010C0401U
#define PORT_PIN_66_EMIF1_D18       0x010C0402U
#define PORT_PIN_66_EMIF1_OEN       0x010C0403U
#define PORT_PIN_66_SPIB_PTE        0x010C0405U
#define PORT_PIN_66_I2CB_SDA        0x010C0406U
#define PORT_PIN_66_ESC_RX1_DATA3   0x010C040AU
#define PORT_PIN_66_SD1_C2          0x010C040BU
#define PORT_PIN_66_FSITXB_D1       0x010C040DU
#define PORT_PIN_66_ADCD_EXTMUXSEL3 0x010C040EU
#define PORT_PIN_66_ESC_GPI14       0x010C040FU

#define PORT_PIN_67_GPIO67     0x010C0600U
#define PORT_PIN_67_EPWM17_A   0x010C0601U
#define PORT_PIN_67_EMIF1_D17  0x010C0602U
#define PORT_PIN_67_LINB_TX    0x010C0605U
#define PORT_PIN_67_MCAND_TX   0x010C0606U
#define PORT_PIN_67_SD1_D3     0x010C060BU
#define PORT_PIN_67_FSITXB_CLK 0x010C060DU

#define PORT_PIN_68_GPIO68              0x010C0800U
#define PORT_PIN_68_EPWM17_B            0x010C0801U
#define PORT_PIN_68_EMIF1_D16           0x010C0802U
#define PORT_PIN_68_EMIF1_D4            0x010C0803U
#define PORT_PIN_68_LINB_RX             0x010C0805U
#define PORT_PIN_68_MCAND_RX            0x010C0806U
#define PORT_PIN_68_EMIF1_D13           0x010C0807U
#define PORT_PIN_68_ESC_PHY1_LINKSTATUS 0x010C080AU
#define PORT_PIN_68_SD1_C3              0x010C080BU
#define PORT_PIN_68_FSIRXB_D1           0x010C080DU
#define PORT_PIN_68_ESC_GPI15           0x010C080FU

#define PORT_PIN_69_GPIO69      0x010C0A00U
#define PORT_PIN_69_EPWM11_A    0x010C0A01U
#define PORT_PIN_69_EMIF1_D15   0x010C0A02U
#define PORT_PIN_69_SPIC_PICO   0x010C0A05U
#define PORT_PIN_69_I2CB_SCL    0x010C0A06U
#define PORT_PIN_69_ESC_RX1_CLK 0x010C0A0AU
#define PORT_PIN_69_SD1_D4      0x010C0A0BU
#define PORT_PIN_69_FSITXB_D0   0x010C0A0DU

