TexasInstruments/f29h85x-mcal/drivers/Port/include/Port_Pin_Map.h
#define PORT_PIN_70_GPIO70     0x010C0C00U
#define PORT_PIN_70_EPWM11_B   0x010C0C01U
#define PORT_PIN_70_EMIF1_D14  0x010C0C02U
#define PORT_PIN_70_SPIC_POCI  0x010C0C05U
#define PORT_PIN_70_MCANC_RX   0x010C0C06U
#define PORT_PIN_70_UARTB_TX   0x010C0C07U
#define PORT_PIN_70_ESC_RX1_DV 0x010C0C0AU
#define PORT_PIN_70_SD1_C4     0x010C0C0BU
#define PORT_PIN_70_FSIRXB_D0  0x010C0C0DU
#define PORT_PIN_70_ESC_GPI16  0x010C0C0FU

#define PORT_PIN_71_GPIO71      0x010C0E00U
#define PORT_PIN_71_EPWM12_A    0x010C0E01U
#define PORT_PIN_71_EPWM11_A    0x010C0E02U
#define PORT_PIN_71_EMIF1_D5    0x010C0E03U
#define PORT_PIN_71_SPIC_CLK    0x010C0E05U
#define PORT_PIN_71_MCANC_TX    0x010C0E06U
#define PORT_PIN_71_UARTB_RX    0x010C0E07U
#define PORT_PIN_71_EMIF1_D13   0x010C0E09U
#define PORT_PIN_71_ESC_RX1_ERR 0x010C0E0AU
#define PORT_PIN_71_SD3_D1      0x010C0E0BU
#define PORT_PIN_71_FSITXC_CLK  0x010C0E0DU
#define PORT_PIN_71_FSITXB_D0   0x010C0E0EU

#define PORT_PIN_72_GPIO72        0x010C1000U
#define PORT_PIN_72_EPWM12_B      0x010C1001U
#define PORT_PIN_72_EMIF1_D12     0x010C1002U
#define PORT_PIN_72_SPIC_PTE      0x010C1005U
#define PORT_PIN_72_MCANB_RX      0x010C1006U
#define PORT_PIN_72_UARTA_TX      0x010C1007U
#define PORT_PIN_72_OUTPUTXBAR8   0x010C1009U
#define PORT_PIN_72_ESC_TX1_DATA3 0x010C100AU
#define PORT_PIN_72_SD3_D2        0x010C100BU
#define PORT_PIN_72_FSITXC_D0     0x010C100DU
#define PORT_PIN_72_SD3_C1        0x010C100EU

#define PORT_PIN_73_GPIO73        0x010C1200U
#define PORT_PIN_73_EPWM5_B       0x010C1201U
#define PORT_PIN_73_EMIF1_D11     0x010C1202U
#define PORT_PIN_73_XCLKOUT       0x010C1203U
#define PORT_PIN_73_MCANB_TX      0x010C1206U
#define PORT_PIN_73_UARTA_RX      0x010C1207U
#define PORT_PIN_73_OUTPUTXBAR6   0x010C1209U
#define PORT_PIN_73_ESC_TX1_DATA2 0x010C120AU
#define PORT_PIN_73_SD4_D4        0x010C120BU
#define PORT_PIN_73_FSITXC_CLK    0x010C120DU
#define PORT_PIN_73_SD2_D2        0x010C120EU

#define PORT_PIN_74_GPIO74        0x010C1400U
#define PORT_PIN_74_EPWM8_A       0x010C1401U
#define PORT_PIN_74_EMIF1_D10     0x010C1402U
#define PORT_PIN_74_MCANC_TX      0x010C1406U
#define PORT_PIN_74_ESC_TX1_DATA1 0x010C140AU
#define PORT_PIN_74_SD1_D4        0x010C140BU
#define PORT_PIN_74_FSITXA_D0     0x010C140DU
#define PORT_PIN_74_SD2_C2        0x010C140EU

#define PORT_PIN_75_GPIO75        0x010C1600U
#define PORT_PIN_75_EPWM8_B       0x010C1601U
#define PORT_PIN_75_EMIF1_D9      0x010C1602U
#define PORT_PIN_75_SPID_CLK      0x010C1605U
#define PORT_PIN_75_MCANC_RX      0x010C1606U
#define PORT_PIN_75_OUTPUTXBAR16  0x010C1609U
#define PORT_PIN_75_ESC_TX1_DATA0 0x010C160AU
#define PORT_PIN_75_SD2_D3        0x010C160EU

#define PORT_PIN_76_GPIO76         0x010C1800U
#define PORT_PIN_76_EPWM9_A        0x010C1801U
#define PORT_PIN_76_EMIF1_D8       0x010C1802U
#define PORT_PIN_76_UARTD_TX       0x010C1805U
#define PORT_PIN_76_MCANE_TX       0x010C1807U
#define PORT_PIN_76_SD4_D4         0x010C1809U
#define PORT_PIN_76_ESC_PHY_RESETN 0x010C180AU
#define PORT_PIN_76_SD3_C1         0x010C180BU
#define PORT_PIN_76_FSIRXC_D0      0x010C180DU
#define PORT_PIN_76_SD2_C3         0x010C180EU
#define PORT_PIN_76_ESC_GPI17      0x010C180FU

#define PORT_PIN_77_GPIO77      0x010C1A00U
#define PORT_PIN_77_EPWM9_B     0x010C1A01U
#define PORT_PIN_77_EMIF1_D7    0x010C1A02U
#define PORT_PIN_77_UARTD_RX    0x010C1A05U
#define PORT_PIN_77_MCANE_RX    0x010C1A07U
#define PORT_PIN_77_SD1_D4      0x010C1A09U
#define PORT_PIN_77_ESC_RX0_CLK 0x010C1A0AU
#define PORT_PIN_77_SD3_D1      0x010C1A0BU
#define PORT_PIN_77_FSITXB_D0   0x010C1A0DU
#define PORT_PIN_77_SD2_D4      0x010C1A0EU

#define PORT_PIN_78_GPIO78     0x010C1C00U
#define PORT_PIN_78_EPWM10_A   0x010C1C01U
#define PORT_PIN_78_EMIF1_D6   0x010C1C02U
#define PORT_PIN_78_EPWM11_A   0x010C1C03U
#define PORT_PIN_78_MCANF_TX   0x010C1C07U
#define PORT_PIN_78_SD4_D4     0x010C1C09U
#define PORT_PIN_78_ESC_RX0_DV 0x010C1C0AU
#define PORT_PIN_78_SD3_C2     0x010C1C0BU
#define PORT_PIN_78_FSITXC_D1  0x010C1C0DU
#define PORT_PIN_78_SD2_C4     0x010C1C0EU
#define PORT_PIN_78_ESC_GPI18  0x010C1C0FU

#define PORT_PIN_79_GPIO79      0x010C1E00U
#define PORT_PIN_79_EPWM10_B    0x010C1E01U
#define PORT_PIN_79_EMIF1_D5    0x010C1E02U
#define PORT_PIN_79_ERRORSTS    0x010C1E05U
#define PORT_PIN_79_ESC_RX0_ERR 0x010C1E0AU
#define PORT_PIN_79_SD3_D2      0x010C1E0BU
#define PORT_PIN_79_FSITXC_D0   0x010C1E0DU
#define PORT_PIN_79_SD2_D1      0x010C1E0EU

#define PORT_PIN_80_GPIO80        0x01100000U
#define PORT_PIN_80_EPWM11_A      0x01100001U
#define PORT_PIN_80_EMIF1_D4      0x01100002U
#define PORT_PIN_80_ERRORSTS      0x01100005U
#define PORT_PIN_80_SD1_D4        0x01100009U
#define PORT_PIN_80_ESC_RX0_DATA0 0x0110000AU
#define PORT_PIN_80_SD3_C3        0x0110000BU
#define PORT_PIN_80_SD2_C1        0x0110000EU

#define PORT_PIN_81_GPIO81        0x01100200U
#define PORT_PIN_81_EPWM11_B      0x01100201U
#define PORT_PIN_81_EMIF1_D3      0x01100202U
#define PORT_PIN_81_ESC_RX0_DATA1 0x0110020AU
#define PORT_PIN_81_SD3_D3        0x0110020BU

#define PORT_PIN_82_GPIO82        0x01100400U
#define PORT_PIN_82_EPWM12_A      0x01100401U
#define PORT_PIN_82_EMIF1_D2      0x01100402U
#define PORT_PIN_82_ESC_RX0_DATA2 0x0110040AU
#define PORT_PIN_82_SD3_C2        0x0110040BU

#define PORT_PIN_83_GPIO83        0x01100600U
#define PORT_PIN_83_EPWM12_B      0x01100601U
#define PORT_PIN_83_EMIF1_D1      0x01100602U
#define PORT_PIN_83_ESC_RX0_DATA3 0x0110060AU
#define PORT_PIN_83_SD3_D2        0x0110060BU

#define PORT_PIN_84_GPIO84        0x01100800U
#define PORT_PIN_84_EPWM12_B      0x01100801U
#define PORT_PIN_84_EMIF1_D1      0x01100802U
#define PORT_PIN_84_EMIF1_CS4N    0x01100803U
#define PORT_PIN_84_SPIC_PICO     0x01100805U
#define PORT_PIN_84_UARTA_TX      0x01100806U
#define PORT_PIN_84_MCANF_RX      0x01100807U
#define PORT_PIN_84_ESC_TX0_ENA   0x0110080AU
#define PORT_PIN_84_SD3_C2        0x0110080BU
#define PORT_PIN_84_FSITXC_D1     0x0110080DU
#define PORT_PIN_84_ESC_RX0_DATA3 0x0110080EU
#define PORT_PIN_84_ESC_GPO24     0x0110080FU

#define PORT_PIN_85_GPIO85      0x01100A00U
#define PORT_PIN_85_EPWM13_A    0x01100A01U
#define PORT_PIN_85_EMIF1_D0    0x01100A02U
#define PORT_PIN_85_UARTA_RX    0x01100A06U
#define PORT_PIN_85_EMIF1_DQM2  0x01100A09U
#define PORT_PIN_85_ESC_TX0_CLK 0x01100A0AU
#define PORT_PIN_85_SD3_D3      0x01100A0BU

#define PORT_PIN_86_GPIO86              0x01100C00U
#define PORT_PIN_86_EPWM13_B            0x01100C01U
#define PORT_PIN_86_EMIF1_A13           0x01100C02U
#define PORT_PIN_86_EMIF1_CAS           0x01100C03U
#define PORT_PIN_86_UARTD_TX            0x01100C06U
#define PORT_PIN_86_ESC_PHY0_LINKSTATUS 0x01100C0AU
#define PORT_PIN_86_SD3_C3              0x01100C0BU

#define PORT_PIN_87_GPIO87        0x01100E00U
#define PORT_PIN_87_EPWM14_A      0x01100E01U
#define PORT_PIN_87_EMIF1_A14     0x01100E02U
#define PORT_PIN_87_EMIF1_RAS     0x01100E03U
#define PORT_PIN_87_UARTD_RX      0x01100E06U
#define PORT_PIN_87_EMIF1_DQM3    0x01100E09U
#define PORT_PIN_87_ESC_TX0_DATA0 0x01100E0AU
#define PORT_PIN_87_SD3_D4        0x01100E0BU

