TexasInstruments/f29h85x-mcal/drivers/Port/include/Port_Pin_Map.h
#define PORT_PIN_88_GPIO88        0x01101000U
#define PORT_PIN_88_EPWM14_B      0x01101001U
#define PORT_PIN_88_EMIF1_A15     0x01101002U
#define PORT_PIN_88_EMIF1_DQM0    0x01101003U
#define PORT_PIN_88_EMIF1_DQM1    0x01101009U
#define PORT_PIN_88_ESC_TX0_DATA1 0x0110100AU
#define PORT_PIN_88_SD3_C4        0x0110100BU

#define PORT_PIN_89_GPIO89        0x01101200U
#define PORT_PIN_89_EPWM15_A      0x01101201U
#define PORT_PIN_89_EMIF1_A16     0x01101202U
#define PORT_PIN_89_EMIF1_DQM1    0x01101203U
#define PORT_PIN_89_SPID_PTE      0x01101205U
#define PORT_PIN_89_EMIF1_CAS     0x01101209U
#define PORT_PIN_89_ESC_TX0_DATA2 0x0110120AU
#define PORT_PIN_89_SD1_D3        0x0110120BU
#define PORT_PIN_89_SD4_D1        0x0110120EU

#define PORT_PIN_90_GPIO90        0x01101400U
#define PORT_PIN_90_EPWM15_B      0x01101401U
#define PORT_PIN_90_EMIF1_A17     0x01101402U
#define PORT_PIN_90_EMIF1_DQM2    0x01101403U
#define PORT_PIN_90_SPID_CLK      0x01101405U
#define PORT_PIN_90_EMIF1_RAS     0x01101409U
#define PORT_PIN_90_ESC_TX0_DATA3 0x0110140AU
#define PORT_PIN_90_SD1_C3        0x0110140BU
#define PORT_PIN_90_SD4_C1        0x0110140EU

#define PORT_PIN_91_GPIO91      0x01101600U
#define PORT_PIN_91_EPWM16_A    0x01101601U
#define PORT_PIN_91_EMIF1_A18   0x01101602U
#define PORT_PIN_91_EMIF1_DQM3  0x01101603U
#define PORT_PIN_91_SPID_PICO   0x01101605U
#define PORT_PIN_91_I2CA_SDA    0x01101606U
#define PORT_PIN_91_MCAND_TX    0x01101607U
#define PORT_PIN_91_EMIF1_DQM2  0x01101609U
#define PORT_PIN_91_SD4_D2      0x0110160BU
#define PORT_PIN_91_OUTPUTXBAR9 0x0110160EU

#define PORT_PIN_92_GPIO92       0x01101800U
#define PORT_PIN_92_EPWM16_B     0x01101801U
#define PORT_PIN_92_EMIF1_A19    0x01101802U
#define PORT_PIN_92_EMIF1_BA1    0x01101803U
#define PORT_PIN_92_SPID_POCI    0x01101805U
#define PORT_PIN_92_I2CA_SCL     0x01101806U
#define PORT_PIN_92_MCAND_RX     0x01101807U
#define PORT_PIN_92_EMIF1_DQM0   0x01101809U
#define PORT_PIN_92_FSIRXD_CLK   0x0110180AU
#define PORT_PIN_92_SD4_C2       0x0110180BU
#define PORT_PIN_92_OUTPUTXBAR10 0x0110180EU

#define PORT_PIN_93_GPIO93       0x01101A00U
#define PORT_PIN_93_EPWM17_A     0x01101A01U
#define PORT_PIN_93_EMIF1_A20    0x01101A02U
#define PORT_PIN_93_EMIF1_BA0    0x01101A03U
#define PORT_PIN_93_SPID_CLK     0x01101A05U
#define PORT_PIN_93_ESC_TX1_CLK  0x01101A0AU
#define PORT_PIN_93_SD4_D3       0x01101A0BU
#define PORT_PIN_93_OUTPUTXBAR11 0x01101A0EU

#define PORT_PIN_94_GPIO94       0x01101C00U
#define PORT_PIN_94_EPWM17_B     0x01101C01U
#define PORT_PIN_94_EMIF1_A21    0x01101C02U
#define PORT_PIN_94_SPID_PTE     0x01101C05U
#define PORT_PIN_94_EMIF1_BA1    0x01101C09U
#define PORT_PIN_94_ESC_TX1_ENA  0x01101C0AU
#define PORT_PIN_94_SD4_C3       0x01101C0BU
#define PORT_PIN_94_OUTPUTXBAR12 0x01101C0EU

#define PORT_PIN_95_GPIO95       0x01101E00U
#define PORT_PIN_95_EPWM18_A     0x01101E01U
#define PORT_PIN_95_ESC_GPO10    0x01101E0AU
#define PORT_PIN_95_SD1_D1       0x01101E0BU
#define PORT_PIN_95_OUTPUTXBAR13 0x01101E0EU

#define PORT_PIN_96_GPIO96       0x018C0000U
#define PORT_PIN_96_EPWM18_B     0x018C0001U
#define PORT_PIN_96_ESC_GPO11    0x018C000AU
#define PORT_PIN_96_SD1_C1       0x018C000BU
#define PORT_PIN_96_OUTPUTXBAR14 0x018C000EU

#define PORT_PIN_97_GPIO97       0x018C0200U
#define PORT_PIN_97_ESC_GPI17    0x018C020AU
#define PORT_PIN_97_SD1_D2       0x018C020BU
#define PORT_PIN_97_OUTPUTXBAR15 0x018C020EU

#define PORT_PIN_98_GPIO98       0x018C0400U
#define PORT_PIN_98_ESC_GPI18    0x018C040AU
#define PORT_PIN_98_SD1_C2       0x018C040BU
#define PORT_PIN_98_OUTPUTXBAR16 0x018C040EU

#define PORT_PIN_99_GPIO99     0x018C0600U
#define PORT_PIN_99_EPWM8_A    0x018C0601U
#define PORT_PIN_99_EMIF1_DQM3 0x018C0602U
#define PORT_PIN_99_EMIF1_D17  0x018C0603U
#define PORT_PIN_99_ESC_GPI21  0x018C060AU
#define PORT_PIN_99_SD4_D4     0x018C060BU

#define PORT_PIN_100_GPIO100   0x018C0800U
#define PORT_PIN_100_EPWM9_A   0x018C0801U
#define PORT_PIN_100_EMIF1_BA1 0x018C0802U
#define PORT_PIN_100_EMIF1_D24 0x018C0803U
#define PORT_PIN_100_SPIC_PICO 0x018C0805U
#define PORT_PIN_100_SPIA_PICO 0x018C0806U
#define PORT_PIN_100_SD1_D1    0x018C0809U
#define PORT_PIN_100_ESC_GPI0  0x018C080AU
#define PORT_PIN_100_SD4_C4    0x018C080BU
#define PORT_PIN_100_FSITXA_D0 0x018C080DU
#define PORT_PIN_100_FSIRXD_D1 0x018C080EU

#define PORT_PIN_101_GPIO101   0x018C0A00U
#define PORT_PIN_101_EPWM18_A  0x018C0A01U
#define PORT_PIN_101_EMIF1_A5  0x018C0A02U
#define PORT_PIN_101_SPIC_POCI 0x018C0A05U
#define PORT_PIN_101_ESC_GPI1  0x018C0A0AU
#define PORT_PIN_101_FSITXA_D1 0x018C0A0DU

#define PORT_PIN_103_GPIO103   0x018C0E00U
#define PORT_PIN_103_EPWM8_B   0x018C0E01U
#define PORT_PIN_103_EMIF1_BA0 0x018C0E02U
#define PORT_PIN_103_EMIF1_D3  0x018C0E03U
#define PORT_PIN_103_SPIC_PTE  0x018C0E05U
#define PORT_PIN_103_ESC_GPI3  0x018C0E0AU
#define PORT_PIN_103_SD4_C4    0x018C0E0BU
#define PORT_PIN_103_FSIRXA_D0 0x018C0E0DU
#define PORT_PIN_103_ESC_GPO25 0x018C0E0FU

#define PORT_PIN_105_GPIO105    0x018C1200U
#define PORT_PIN_105_EPWM18_B   0x018C1201U
#define PORT_PIN_105_I2CA_SCL   0x018C1205U
#define PORT_PIN_105_ESC_GPI5   0x018C120AU
#define PORT_PIN_105_SD3_C1     0x018C120BU
#define PORT_PIN_105_FSIRXA_CLK 0x018C120DU

#define PORT_PIN_127_GPIO127   0x01901E00U
#define PORT_PIN_127_EPWM18_A  0x01901E01U
#define PORT_PIN_127_EMIF1_D18 0x01901E02U
#define PORT_PIN_127_EMIF1_A11 0x01901E03U
#define PORT_PIN_127_SPID_POCI 0x01901E05U
#define PORT_PIN_127_ESC_GPI27 0x01901E0AU
#define PORT_PIN_127_SD1_C3    0x01901E0BU
#define PORT_PIN_127_FSIRXC_D1 0x01901E0DU
#define PORT_PIN_127_ESC_SYNC0 0x01901E0EU
#define PORT_PIN_127_ESC_GPO26 0x01901E0FU

#define PORT_PIN_219_GPIO219     0x03101600U
#define PORT_PIN_219_ERRORSTS    0x03101601U
#define PORT_PIN_219_EMIF1_A19   0x03101602U
#define PORT_PIN_219_EPWM18_B    0x03101603U
#define PORT_PIN_219_OUTPUTXBAR1 0x03101609U
#define PORT_PIN_219_XCLKOUT     0x0310160AU
#define PORT_PIN_219_SD2_C1      0x0310160BU
#define PORT_PIN_219_ESC_GPI8    0x0310160DU
#define PORT_PIN_219_ESC_TX0_ENA 0x0310160EU
#define PORT_PIN_219_ESC_GPO27   0x0310160FU

