TexasInstruments/f29h85x-mcal/drivers/Port/include/Port_Pin_Map.h
#define PORT_PIN_220_GPIO220     0x03101800U
#define PORT_PIN_220_EPWM6_A     0x03101801U
#define PORT_PIN_220_EMIF1_A20   0x03101802U
#define PORT_PIN_220_SPID_POCI   0x03101805U
#define PORT_PIN_220_MCANC_TX    0x03101806U
#define PORT_PIN_220_OUTPUTXBAR2 0x03101809U
#define PORT_PIN_220_SD3_D3      0x0310180BU
#define PORT_PIN_220_ESC_GPI9    0x0310180DU
#define PORT_PIN_220_ESC_GPO28   0x0310180FU

#define PORT_PIN_221_GPIO221     0x03101A00U
#define PORT_PIN_221_EPWM6_B     0x03101A01U
#define PORT_PIN_221_EMIF1_A21   0x03101A02U
#define PORT_PIN_221_EMIF1_CAS   0x03101A03U
#define PORT_PIN_221_SPID_PTE    0x03101A05U
#define PORT_PIN_221_MCANC_RX    0x03101A06U
#define PORT_PIN_221_OUTPUTXBAR3 0x03101A09U
#define PORT_PIN_221_SD3_C3      0x03101A0BU
#define PORT_PIN_221_ESC_GPI10   0x03101A0DU
#define PORT_PIN_221_ESC_GPO29   0x03101A0FU

#define PORT_PIN_222_GPIO222     0x03101C00U
#define PORT_PIN_222_TDI         0x03101C01U
#define PORT_PIN_222_EPWM7_A     0x03101C02U
#define PORT_PIN_222_SPID_PICO   0x03101C05U
#define PORT_PIN_222_UARTB_TX    0x03101C06U
#define PORT_PIN_222_I2CB_SCL    0x03101C07U
#define PORT_PIN_222_OUTPUTXBAR4 0x03101C09U
#define PORT_PIN_222_SPIC_CLK    0x03101C0AU
#define PORT_PIN_222_SD3_D4      0x03101C0BU
#define PORT_PIN_222_ESC_GPI11   0x03101C0DU
#define PORT_PIN_222_ESC_GPO30   0x03101C0FU

#define PORT_PIN_223_GPIO223     0x03101E00U
#define PORT_PIN_223_TDO         0x03101E01U
#define PORT_PIN_223_EPWM7_B     0x03101E02U
#define PORT_PIN_223_SPID_CLK    0x03101E05U
#define PORT_PIN_223_UARTB_RX    0x03101E06U
#define PORT_PIN_223_I2CB_SDA    0x03101E07U
#define PORT_PIN_223_OUTPUTXBAR5 0x03101E09U
#define PORT_PIN_223_SPIC_PTE    0x03101E0AU
#define PORT_PIN_223_SD3_C4      0x03101E0BU
#define PORT_PIN_223_ESC_GPI12   0x03101E0DU
#define PORT_PIN_223_ESC_GPO31   0x03101E0FU

#define PORT_PIN_160_AIO160 0x028C0000U
#define PORT_PIN_160_SD3_C2 0x028C000BU

#define PORT_PIN_161_AIO161 0x028C0200U
#define PORT_PIN_161_SD3_D2 0x028C020BU

#define PORT_PIN_162_AIO162 0x028C0400U
#define PORT_PIN_162_SD2_C2 0x028C040BU

#define PORT_PIN_163_AIO163 0x028C0600U
#define PORT_PIN_163_SD2_D2 0x028C060BU

#define PORT_PIN_164_AIO164 0x028C0800U
#define PORT_PIN_164_SD2_C3 0x028C080BU

#define PORT_PIN_165_AIO165 0x028C0A00U
#define PORT_PIN_165_SD2_D3 0x028C0A0BU

#define PORT_PIN_224_GPIO224         0x038C0000U
#define PORT_PIN_224_EPWM12_A        0x038C0001U
#define PORT_PIN_224_EPWM12_B        0x038C0002U
#define PORT_PIN_224_SPIB_POCI       0x038C0005U
#define PORT_PIN_224_MCAND_RX        0x038C0006U
#define PORT_PIN_224_OUTPUTXBAR5     0x038C0009U
#define PORT_PIN_224_SD4_D2          0x038C000BU
#define PORT_PIN_224_ADCA_EXTMUXSEL0 0x038C000EU
#define PORT_PIN_224_ESC_GPO8        0x038C000FU

#define PORT_PIN_225_GPIO225         0x038C0200U
#define PORT_PIN_225_EPWM11_B        0x038C0201U
#define PORT_PIN_225_SPIB_PICO       0x038C0205U
#define PORT_PIN_225_I2CB_SDA        0x038C0206U
#define PORT_PIN_225_UARTF_TX        0x038C0207U
#define PORT_PIN_225_OUTPUTXBAR4     0x038C0209U
#define PORT_PIN_225_SD4_C1          0x038C020BU
#define PORT_PIN_225_ADCA_EXTMUXSEL1 0x038C020EU
#define PORT_PIN_225_ESC_GPO9        0x038C020FU

#define PORT_PIN_226_GPIO226         0x038C0400U
#define PORT_PIN_226_EPWM10_A        0x038C0401U
#define PORT_PIN_226_SPIA_PTE        0x038C0405U
#define PORT_PIN_226_MCAND_TX        0x038C0406U
#define PORT_PIN_226_UARTF_RX        0x038C0407U
#define PORT_PIN_226_OUTPUTXBAR1     0x038C0409U
#define PORT_PIN_226_SD1_C3          0x038C040AU
#define PORT_PIN_226_SD1_D3          0x038C040BU
#define PORT_PIN_226_ADCA_EXTMUXSEL2 0x038C040EU
#define PORT_PIN_226_ESC_GPO10       0x038C040FU

#define PORT_PIN_227_GPIO227         0x038C0600U
#define PORT_PIN_227_EPWM14_B        0x038C0601U
#define PORT_PIN_227_SPIA_CLK        0x038C0605U
#define PORT_PIN_227_OUTPUTXBAR4     0x038C0609U
#define PORT_PIN_227_SD2_C2          0x038C060BU
#define PORT_PIN_227_ADCA_EXTMUXSEL3 0x038C060EU

#define PORT_PIN_228_GPIO228     0x038C0800U
#define PORT_PIN_228_EPWM18_A    0x038C0801U
#define PORT_PIN_228_EPWM13_A    0x038C0802U
#define PORT_PIN_228_SPIB_POCI   0x038C0805U
#define PORT_PIN_228_LINB_TX     0x038C0806U
#define PORT_PIN_228_OUTPUTXBAR1 0x038C0809U
#define PORT_PIN_228_SENT4       0x038C080AU
#define PORT_PIN_228_SD2_D1      0x038C080BU

#define PORT_PIN_229_GPIO229   0x038C0A00U
#define PORT_PIN_229_EPWM17_B  0x038C0A01U
#define PORT_PIN_229_EPWM12_B  0x038C0A02U
#define PORT_PIN_229_SPIB_PICO 0x038C0A05U
#define PORT_PIN_229_MCANA_RX  0x038C0A06U
#define PORT_PIN_229_SENT3     0x038C0A0AU
#define PORT_PIN_229_SD1_C4    0x038C0A0BU

#define PORT_PIN_166_AIO166 0x028C0C00U
#define PORT_PIN_166_SD4_C1 0x028C0C0BU

#define PORT_PIN_167_AIO167 0x028C0E00U
#define PORT_PIN_167_SD4_D1 0x028C0E0BU

#define PORT_PIN_168_AIO168 0x028C1000U
#define PORT_PIN_168_SD3_C3 0x028C100BU

#define PORT_PIN_169_AIO169 0x028C1200U
#define PORT_PIN_169_SD3_D3 0x028C120BU

#define PORT_PIN_170_AIO170 0x028C1400U
#define PORT_PIN_170_SD3_C4 0x028C140BU

#define PORT_PIN_171_AIO171 0x028C1600U
#define PORT_PIN_171_SD3_D4 0x028C160BU

#define PORT_PIN_172_AIO172 0x028C1800U
#define PORT_PIN_172_SD1_C1 0x028C180BU

#define PORT_PIN_173_AIO173 0x028C1A00U
#define PORT_PIN_173_SD1_D1 0x028C1A0BU

#define PORT_PIN_174_AIO174 0x028C1C00U
#define PORT_PIN_174_SD2_C4 0x028C1C0BU

#define PORT_PIN_175_AIO175 0x028C1E00U
#define PORT_PIN_175_SD2_D4 0x028C1E0BU

#define PORT_PIN_230_GPIO230         0x038C0C00U
#define PORT_PIN_230_EPWM11_A        0x038C0C01U
#define PORT_PIN_230_SYNCOUT         0x038C0C03U
#define PORT_PIN_230_I2CB_SCL        0x038C0C06U
#define PORT_PIN_230_OUTPUTXBAR3     0x038C0C09U
#define PORT_PIN_230_SD4_D1          0x038C0C0BU
#define PORT_PIN_230_ADCB_EXTMUXSEL0 0x038C0C0EU

#define PORT_PIN_231_GPIO231         0x038C0E00U
#define PORT_PIN_231_EPWM10_B        0x038C0E01U
#define PORT_PIN_231_SPIA_PICO       0x038C0E05U
#define PORT_PIN_231_MCAND_RX        0x038C0E06U
#define PORT_PIN_231_OUTPUTXBAR2     0x038C0E09U
#define PORT_PIN_231_SD1_C3          0x038C0E0BU
#define PORT_PIN_231_ADCB_EXTMUXSEL1 0x038C0E0EU

#define PORT_PIN_232_GPIO232             0x038C1000U
#define PORT_PIN_232_EPWM14_A            0x038C1001U
#define PORT_PIN_232_EPWM8_B             0x038C1002U
#define PORT_PIN_232_SPIA_POCI           0x038C1005U
#define PORT_PIN_232_OUTPUTXBAR3         0x038C1009U
#define PORT_PIN_232_SENT6               0x038C100AU
#define PORT_PIN_232_SD3_D1              0x038C100BU
#define PORT_PIN_232_ESC_PHY0_LINKSTATUS 0x038C100DU
#define PORT_PIN_232_ADCB_EXTMUXSEL2     0x038C100EU
#define PORT_PIN_232_ESC_GPO11           0x038C100FU

#define PORT_PIN_233_GPIO233             0x038C1200U
#define PORT_PIN_233_EPWM18_B            0x038C1201U
#define PORT_PIN_233_EPWM13_B            0x038C1202U
#define PORT_PIN_233_LINB_RX             0x038C1206U
#define PORT_PIN_233_OUTPUTXBAR2         0x038C1209U
#define PORT_PIN_233_SENT5               0x038C120AU
#define PORT_PIN_233_SD2_C1              0x038C120BU
#define PORT_PIN_233_ESC_PHY1_LINKSTATUS 0x038C120DU
#define PORT_PIN_233_ADCB_EXTMUXSEL3     0x038C120EU
#define PORT_PIN_233_ESC_GPO12           0x038C120FU

#define PORT_PIN_234_GPIO234   0x038C1400U
#define PORT_PIN_234_EPWM17_A  0x038C1401U
#define PORT_PIN_234_EPWM12_A  0x038C1402U
#define PORT_PIN_234_SPIB_PTE  0x038C1405U
#define PORT_PIN_234_MCANA_TX  0x038C1406U
#define PORT_PIN_234_SENT2     0x038C140AU
#define PORT_PIN_234_SD1_D4    0x038C140BU
#define PORT_PIN_234_ESC_GPO13 0x038C140FU

#define PORT_PIN_235_GPIO235   0x038C1600U
#define PORT_PIN_235_EPWM9_B   0x038C1601U
#define PORT_PIN_235_SPIB_CLK  0x038C1605U
#define PORT_PIN_235_MCANA_RX  0x038C1606U
#define PORT_PIN_235_SENT1     0x038C160AU
#define PORT_PIN_235_SD1_C1    0x038C160BU
#define PORT_PIN_235_ESC_GPO14 0x038C160FU

