TexasInstruments/f29h85x-mcal/drivers/Port/include/Port_Pin_Map.h
#define PORT_PIN_176_AIO176 0x02900000U
#define PORT_PIN_176_SD4_C2 0x0290000BU

#define PORT_PIN_177_AIO177 0x02900200U
#define PORT_PIN_177_SD4_D2 0x0290020BU

#define PORT_PIN_178_AIO178 0x02900400U
#define PORT_PIN_178_SD4_C3 0x0290040BU

#define PORT_PIN_179_AIO179 0x02900600U
#define PORT_PIN_179_SD4_D3 0x0290060BU

#define PORT_PIN_180_AIO180 0x02900800U
#define PORT_PIN_180_SD1_C2 0x0290080BU

#define PORT_PIN_181_AIO181 0x02900A00U
#define PORT_PIN_181_SD1_D2 0x02900A0BU

#define PORT_PIN_182_AIO182 0x02900C00U
#define PORT_PIN_182_SD3_C1 0x02900C0BU

#define PORT_PIN_183_AIO183 0x02900E00U
#define PORT_PIN_183_SD3_D1 0x02900E0BU

#define PORT_PIN_184_AIO184 0x02901000U
#define PORT_PIN_184_SD3_C2 0x0290100BU

#define PORT_PIN_185_AIO185 0x02901200U
#define PORT_PIN_185_SD3_D2 0x0290120BU

#define PORT_PIN_236_GPIO236         0x038C1800U
#define PORT_PIN_236_EPWM12_B        0x038C1801U
#define PORT_PIN_236_EPWM8_A         0x038C1802U
#define PORT_PIN_236_LINA_RX         0x038C1806U
#define PORT_PIN_236_OUTPUTXBAR6     0x038C1809U
#define PORT_PIN_236_SD4_C2          0x038C180BU
#define PORT_PIN_236_ESC_I2C_SDA     0x038C180DU
#define PORT_PIN_236_ADCC_EXTMUXSEL0 0x038C180EU

#define PORT_PIN_237_GPIO237         0x038C1A00U
#define PORT_PIN_237_EPWM14_A        0x038C1A01U
#define PORT_PIN_237_EPWM8_B         0x038C1A02U
#define PORT_PIN_237_EPWM17_B        0x038C1A03U
#define PORT_PIN_237_LINA_TX         0x038C1A06U
#define PORT_PIN_237_I2CA_SDA        0x038C1A07U
#define PORT_PIN_237_OUTPUTXBAR7     0x038C1A09U
#define PORT_PIN_237_SD4_D3          0x038C1A0BU
#define PORT_PIN_237_ESC_I2C_SCL     0x038C1A0DU
#define PORT_PIN_237_ADCC_EXTMUXSEL1 0x038C1A0EU

#define PORT_PIN_238_GPIO238         0x038C1C00U
#define PORT_PIN_238_EPWM15_B        0x038C1C01U
#define PORT_PIN_238_OUTPUTXBAR6     0x038C1C09U
#define PORT_PIN_238_SD1_D3          0x038C1C0AU
#define PORT_PIN_238_SD2_C3          0x038C1C0BU
#define PORT_PIN_238_ESC_SYNC0       0x038C1C0DU
#define PORT_PIN_238_ADCC_EXTMUXSEL2 0x038C1C0EU
#define PORT_PIN_238_ESC_GPO15       0x038C1C0FU

#define PORT_PIN_239_GPIO239         0x038C1E00U
#define PORT_PIN_239_EPWM16_B        0x038C1E01U
#define PORT_PIN_239_LINB_TX         0x038C1E06U
#define PORT_PIN_239_I2CA_SCL        0x038C1E07U
#define PORT_PIN_239_OUTPUTXBAR8     0x038C1E09U
#define PORT_PIN_239_SD2_C4          0x038C1E0BU
#define PORT_PIN_239_ESC_SYNC1       0x038C1E0DU
#define PORT_PIN_239_ADCC_EXTMUXSEL3 0x038C1E0EU
#define PORT_PIN_239_ESC_GPO16       0x038C1E0FU

#define PORT_PIN_186_AIO186 0x02901400U
#define PORT_PIN_186_SD1_C1 0x0290140BU

#define PORT_PIN_187_AIO187 0x02901600U
#define PORT_PIN_187_SD1_D1 0x0290160BU

#define PORT_PIN_188_AIO188 0x02901800U
#define PORT_PIN_188_SD1_C2 0x0290180BU

#define PORT_PIN_189_AIO189 0x02901A00U
#define PORT_PIN_189_SD1_D2 0x02901A0BU

#define PORT_PIN_190_AIO190 0x02901C00U
#define PORT_PIN_190_SD1_C3 0x02901C0BU

#define PORT_PIN_191_AIO191 0x02901E00U
#define PORT_PIN_191_SD1_D3 0x02901E0BU

#define PORT_PIN_192_AIO192 0x030C0000U
#define PORT_PIN_192_SD1_C3 0x030C000BU

#define PORT_PIN_193_AIO193 0x030C0200U
#define PORT_PIN_193_SD1_D3 0x030C020BU

#define PORT_PIN_194_AIO194 0x030C0400U
#define PORT_PIN_194_SD1_C4 0x030C040BU

#define PORT_PIN_195_AIO195 0x030C0600U
#define PORT_PIN_195_SD1_D4 0x030C060BU

#define PORT_PIN_240_GPIO240         0x03900000U
#define PORT_PIN_240_EPWM14_B        0x03900001U
#define PORT_PIN_240_SPID_PICO       0x03900005U
#define PORT_PIN_240_SD4_C3          0x0390000BU
#define PORT_PIN_240_ESC_LED_RUN     0x0390000DU
#define PORT_PIN_240_ADCD_EXTMUXSEL0 0x0390000EU

#define PORT_PIN_241_GPIO241         0x03900200U
#define PORT_PIN_241_EPWM8_A         0x03900201U
#define PORT_PIN_241_SPID_CLK        0x03900205U
#define PORT_PIN_241_SD4_D4          0x0390020BU
#define PORT_PIN_241_ESC_LED_ERR     0x0390020DU
#define PORT_PIN_241_ADCD_EXTMUXSEL1 0x0390020EU
#define PORT_PIN_241_ESC_GPO17       0x0390020FU

#define PORT_PIN_242_GPIO242           0x03900400U
#define PORT_PIN_242_SD1_D4            0x03900406U
#define PORT_PIN_242_I2CA_SDA          0x03900407U
#define PORT_PIN_242_OUTPUTXBAR9       0x03900409U
#define PORT_PIN_242_SENT1             0x0390040AU
#define PORT_PIN_242_SD2_D2            0x0390040BU
#define PORT_PIN_242_ESC_LED_STATE_RUN 0x0390040DU
#define PORT_PIN_242_ADCD_EXTMUXSEL2   0x0390040EU
#define PORT_PIN_242_ESC_GPO18         0x0390040FU

#define PORT_PIN_243_GPIO243              0x03900600U
#define PORT_PIN_243_EPWM8_B              0x03900601U
#define PORT_PIN_243_SENT2                0x0390060AU
#define PORT_PIN_243_SD2_D4               0x0390060BU
#define PORT_PIN_243_ESC_LED_LINK0_ACTIVE 0x0390060DU
#define PORT_PIN_243_ADCD_EXTMUXSEL3      0x0390060EU
#define PORT_PIN_243_ESC_GPO19            0x0390060FU

#define PORT_PIN_244_GPIO244              0x03900800U
#define PORT_PIN_244_SPIC_PTE             0x03900805U
#define PORT_PIN_244_SENT5                0x0390080AU
#define PORT_PIN_244_SD4_C4               0x0390080BU
#define PORT_PIN_244_ESC_LED_LINK1_ACTIVE 0x0390080DU

#define PORT_PIN_245_GPIO245        0x03900A00U
#define PORT_PIN_245_SPIC_POCI      0x03900A05U
#define PORT_PIN_245_SENT6          0x03900A0AU
#define PORT_PIN_245_SD3_C1         0x03900A0BU
#define PORT_PIN_245_ESC_PHY_RESETN 0x03900A0DU

#define PORT_PIN_196_AIO196 0x030C0800U
#define PORT_PIN_196_SD4_C4 0x030C080BU

#define PORT_PIN_197_AIO197 0x030C0A00U
#define PORT_PIN_197_SD4_D4 0x030C0A0BU

#define PORT_PIN_198_AIO198 0x030C0C00U
#define PORT_PIN_198_SD1_C4 0x030C0C0BU

#define PORT_PIN_199_AIO199 0x030C0E00U
#define PORT_PIN_199_SD1_D4 0x030C0E0BU

#define PORT_PIN_200_AIO200 0x030C1000U
#define PORT_PIN_200_SD2_C1 0x030C100BU

#define PORT_PIN_201_AIO201 0x030C1200U
#define PORT_PIN_201_SD2_D1 0x030C120BU

#define PORT_PIN_202_AIO202 0x030C1400U
#define PORT_PIN_202_SD2_C1 0x030C140BU

#define PORT_PIN_203_AIO203 0x030C1600U
#define PORT_PIN_203_SD2_D1 0x030C160BU

#define PORT_PIN_204_AIO204 0x030C1800U
#define PORT_PIN_204_SD3_C3 0x030C180BU

#define PORT_PIN_205_AIO205 0x030C1A00U
#define PORT_PIN_205_SD3_D3 0x030C1A0BU

#define PORT_PIN_246_GPIO246         0x03900C00U
#define PORT_PIN_246_EPWM16_A        0x03900C01U
#define PORT_PIN_246_SPID_PTE        0x03900C05U
#define PORT_PIN_246_MCANC_RX        0x03900C06U
#define PORT_PIN_246_OUTPUTXBAR7     0x03900C09U
#define PORT_PIN_246_SD1_D1          0x03900C0BU
#define PORT_PIN_246_ADCE_EXTMUXSEL0 0x03900C0EU
#define PORT_PIN_246_ESC_GPO20       0x03900C0FU

#define PORT_PIN_247_GPIO247         0x03900E00U
#define PORT_PIN_247_EPWM15_A        0x03900E01U
#define PORT_PIN_247_ERRORSTS        0x03900E02U
#define PORT_PIN_247_SPID_POCI       0x03900E05U
#define PORT_PIN_247_MCANC_RX        0x03900E06U
#define PORT_PIN_247_LINA_TX         0x03900E07U
#define PORT_PIN_247_OUTPUTXBAR5     0x03900E09U
#define PORT_PIN_247_SD2_D3          0x03900E0BU
#define PORT_PIN_247_ADCE_EXTMUXSEL1 0x03900E0EU
#define PORT_PIN_247_ESC_GPO21       0x03900E0FU

#define PORT_PIN_248_GPIO248         0x03901000U
#define PORT_PIN_248_EMIF1_SDCKE     0x03901002U
#define PORT_PIN_248_SPIC_PICO       0x03901005U
#define PORT_PIN_248_SENT3           0x0390100AU
#define PORT_PIN_248_SD1_C2          0x0390100BU
#define PORT_PIN_248_ESC_LED_RUN     0x0390100DU
#define PORT_PIN_248_ADCE_EXTMUXSEL2 0x0390100EU
#define PORT_PIN_248_ESC_GPO22       0x0390100FU

#define PORT_PIN_249_GPIO249             0x03901200U
#define PORT_PIN_249_SPIC_CLK            0x03901205U
#define PORT_PIN_249_SENT4               0x0390120AU
#define PORT_PIN_249_SD1_D2              0x0390120BU
#define PORT_PIN_249_ESC_PHY0_LINKSTATUS 0x0390120DU
#define PORT_PIN_249_ADCE_EXTMUXSEL3     0x0390120EU
#define PORT_PIN_249_ESC_GPO23           0x0390120FU

#define PORT_PIN_206_AIO206 0x030C1C00U
#define PORT_PIN_206_SD3_C4 0x030C1C0BU

#define PORT_PIN_207_AIO207 0x030C1E00U
#define PORT_PIN_207_SD3_D4 0x030C1E0BU

#define PORT_PIN_208_AIO208 0x03100000U
#define PORT_PIN_208_SD2_C2 0x0310000BU

#define PORT_PIN_209_AIO209 0x03100200U
#define PORT_PIN_209_SD2_D2 0x0310020BU

#define PORT_PIN_210_AIO210 0x03100400U
#define PORT_PIN_210_SD2_C3 0x0310040BU

#define PORT_PIN_211_AIO211 0x03100600U
#define PORT_PIN_211_SD2_D3 0x0310060BU

