TexasInstruments/f29h85x-mcal/drivers/Port/include/Port_Pin_Map.h
#define PORT_PIN_212_AIO212 0x03100800U
#define PORT_PIN_212_SD2_C4 0x0310080BU

#define PORT_PIN_213_AIO213 0x03100A00U
#define PORT_PIN_213_SD2_D4 0x03100A0BU

#define PORT_PIN_MUXMODE_NA 0xFFFFFFFFU

/*********************************************************************************************************************
 * Exported Preprocessor #define Macros
 *********************************************************************************************************************/

/*********************************************************************************************************************
 * Exported Type Declarations
 *********************************************************************************************************************/

/*********************************************************************************************************************
 * Exported Object Declarations
 *********************************************************************************************************************/

/*********************************************************************************************************************
 *  Exported Function Prototypes
 *********************************************************************************************************************/

/*********************************************************************************************************************
 *  Exported Inline Function Definitions and Function-Like Macros
 *********************************************************************************************************************/

#ifdef __cplusplus
}
#endif

#endif /* PORT_PIN_MAP_H */
/*********************************************************************************************************************
 *  End of File: Port_Pin_Map.h
 *********************************************************************************************************************/
